[{"pageContent":"Automated Pricing in AutotechClient Overview ‍Mobile Tech RX (MTRX) is transforming the auto reconditioning industry by delivering an auto repair app built by technicians, for technicians. The Mobile Tech RX app makes it easy for technicians to estimate, invoice, manage teams, and capture data on-the-go and from a phone.Client Needs‍Mobile Tech RX came to KUNGFU.AI with some lofty goals. They wanted to build an automated pricing tool so customers could get a quote to repair their car's bodywork in seconds. The MTRX team had undertaken a large internal labeling effort, manually labeling over three thousand images of dents in vehicles, across all shapes, sizes, models, colors and make. They then annotated and denoted the pictures with the labels “dent”, “hail”, “paint”, or “conventional” (beyond repair). Solution‍As the KUNGFU.AI team dove in, they ended up discovering MTRX’s problem. Although it was well-intentioned, MTRX’s labeling system was not ideal. MTRX shared with us their initial attempt at the problem set, which was an out-of-the-box object detection model. This model underperformed and did not give them the ability to price individual dents reliably.KUNGFU.AI researched this problem set, and identified a better model that had the capability to produce better object detection results, and to produce a per-dent pricing output. This new, better model choice offered higher accuracy, better configurability and tuning, and enabled MTRX to add additional classification or regression outputs per dent when MTRX decided to increase their model’s capability. Additionally, during the project, to avoid an expensive and redundant labeling effort, the KUNGFU.AI team leveraged classic data science approaches to make use of the existing deficient data set to achieve a useful model. We at KUNGFU.AI pride ourselves on leaving our clients with a working solution, and the knowledge to operate, and even extend the solution; during our engagement we had weekly sessions with the MTRX technical team to teach them Machine Learning and Deep Learning fundamentals, and help them understand every component of our delivered solution. ResultsThe data set was small, but original scoring of the model deemed the project a successKUNGFU.AI and MTRX deployed to Amazon Web Services (AWS) and began immediately integrating the modeling into their direct-to-consumer application KUNGFU.AI and MTRX began pair programming to hand off and implement the code, correctly ‍Computer VisionlabellingAICase StudiesObject DetectionAutomated Pricing in AutotechClient Overview ‍Mobile Tech RX (MTRX) is transforming the auto reconditioning industry by delivering an auto repair app built by technicians, for technicians. The Mobile Tech RX app makes it easy for technicians to estimate, invoice, manage teams, and capture data on-the-go and from a phone.Client Needs‍Mobile Tech RX came to KUNGFU.AI with some lofty goals. They wanted to build an automated pricing tool so customers could get a quote to repair their car's bodywork in seconds. The MTRX team had undertaken a large internal labeling effort, manually labeling over three thousand images of dents in vehicles, across all shapes, sizes, models, colors and make. They then annotated and denoted the pictures with the labels “dent”, “hail”, “paint”, or “conventional” (beyond repair). Solution‍As the KUNGFU.AI team dove in, they ended up discovering MTRX’s problem. Although it was well-intentioned, MTRX’s labeling system was not ideal. MTRX shared with us their initial attempt at the problem set, which was an out-of-the-box object detection model. This model underperformed and did not give them the ability to price individual dents reliably.KUNGFU.AI researched this problem set, and identified a better model that had the capability to produce better object detection results, and to produce a per-dent pricing output. This new, better model choice offered higher accuracy, better configurability and tuning, and enabled MTRX to add additional classification or regression outputs per dent when MTRX decided to increase their model’s capability. Additionally, during the project, to avoid an expensive and redundant labeling effort, the KUNGFU.AI team leveraged classic data science approaches to make use of the existing deficient data set to achieve a useful model. We at KUNGFU.AI pride ourselves on leaving our clients with a working solution, and the knowledge to operate, and even extend the solution; during our engagement we had weekly sessions with the MTRX technical team to teach them Machine Learning and Deep Learning fundamentals, and help them understand every component of our delivered solution. ResultsThe data set was small, but original scoring of the model deemed the project a successKUNGFU.AI and MTRX deployed to Amazon Web Services (AWS) and began immediately integrating the modeling into their direct-to-consumer application KUNGFU.AI and MTRX began pair programming to hand off and implement the code, correctly ‍Computer VisionlabellingAICase StudiesObject Detection","metadata":{"source":"https://www.kungfu.ai/case-study/automated-pricing-in-autotech","title":"Automated Pricing in AutotechAutomated Pricing in Autotech","contentLength":803}},{"pageContent":"Waste Management Early Alert Rear Safety DeviceChallenge‍Waste Management is the leading provider of comprehensive waste management services in North America and saw the need for a detection system that would protect on-vehicle riders. Rear loader residential collection vehicles require two passengers to ride on the back of the vehicle as waste is collected. Those riders risk severe injury, even death, from the occasional rear-end collisions with other passenger cars. Currently, there is no detection system to alert the riders to potential oncoming accidents, besides the riders and driver being alert and aware. Creating an automated detection system for the oncoming vehicles that pose risk for the riders could reduce injuries and save lives.‍Solution‍To provide a solution that would be easy to implement and keep riders safe, Waste Management conceived of and envisioned an edge device and hardware system that could be embedded onto trucks to alert riders when oncoming traffic poses a risk, and engaged KUNGFU.AI to help develop a platform for a computer vision model that would identify oncoming risks and trigger an alert. The device is powered by a USB battery and features Edge TPUs that allow for high-performance machine learning computing on low-power devices. We custom-built an ensemble of computer vision models, running on edge devices and deployed on Google Cloud Platform. We leveraged state-of-the-art detection and segmentation frameworks to bifurcate trailing vehicles from other non-threatening objects. In addition, we built a threat prediction model that calculates speed, velocity, and distance to make a threat prediction for identified oncoming vehicles. If the vehicle was deemed a potential threat, an embedded sensor would alert riders to brace for impact.Outcome‍The Waste Management Early Alert Rear Safety Device has been tested in the field and successfully alerted on-vehicle riders to potential oncoming danger. Before deploying on vehicles, parking lot testing revealed that detection took 0.05 second per frame, with tracking and scoring taking 0.05 second per frame. The performed testing was highly accurate with no false negatives reported. Segmentation model that can understand the difference between people, objects, and moving vehicles.Demonstration of a model calculating the threat of an oncoming vehicle.‍Computer VisionMachine LearningArtificial IntelligenceIoTWearable DevicesWaste Management Early Alert Rear Safety DeviceChallenge‍Waste Management is the leading provider of comprehensive waste management services in North America and saw the need for a detection system that would protect on-vehicle riders. Rear loader residential collection vehicles require two passengers to ride on the back of the vehicle as waste is collected. Those riders risk severe injury, even death, from the occasional rear-end collisions with other passenger cars. Currently, there is no detection system to alert the riders to potential oncoming accidents, besides the riders and driver being alert and aware. Creating an automated detection system for the oncoming vehicles that pose risk for the riders could reduce injuries and save lives.‍Solution‍To provide a solution that would be easy to implement and keep riders safe, Waste Management conceived of and envisioned an edge device and hardware system that could be embedded onto trucks to alert riders when oncoming traffic poses a risk, and engaged KUNGFU.AI to help develop a platform for a computer vision model that would identify oncoming risks and trigger an alert. The device is powered by a USB battery and features Edge TPUs that allow for high-performance machine learning computing on low-power devices. We custom-built an ensemble of computer vision models, running on edge devices and deployed on Google Cloud Platform. We leveraged state-of-the-art detection and segmentation frameworks to bifurcate trailing vehicles from other non-threatening objects. In addition, we built a threat prediction model that calculates speed, velocity, and distance to make a threat prediction for identified oncoming vehicles. If the vehicle was deemed a potential threat, an embedded sensor would alert riders to brace for impact.Outcome‍The Waste Management Early Alert Rear Safety Device has been tested in the field and successfully alerted on-vehicle riders to potential oncoming danger. Before deploying on vehicles, parking lot testing revealed that detection took 0.05 second per frame, with tracking and scoring taking 0.05 second per frame. The performed testing was highly accurate with no false negatives reported. Segmentation model that can understand the difference between people, objects, and moving vehicles.Demonstration of a model calculating the threat of an oncoming vehicle.‍Computer VisionMachine LearningArtificial IntelligenceIoTWearable Devices","metadata":{"source":"https://www.kungfu.ai/case-study/waste-management-early-alert-rear-safety-device","title":"Waste Management Early Alert Rear Safety DeviceWaste Management Early Alert Rear Safety Device","contentLength":749}},{"pageContent":"NLP for Document IntegrityChallengeIodine Software is a software group based in Austin Texas which provides Clinical Document Integrity (CDI) software to hospital systems and clinics across the U.S. They sought to improve their CDI product by using machine learning to extract specific and relevant information from documents and build a competitive moat by leveraging their troves of valuable un-tapped data.SolutionWorking in tandem with Iodine’s existing ML team, KUNGFU.AI leveraged massively pre-trained state of the art natural language models to automatically categorize medical documentation into insurance coding categories. The performance of this model rivals human SME capability.OutcomeWith the improvements made to Iodine’s product, hospitals and clinics across the U.S. are able to recoup millions in unbilled revenue and reduce human tedium. KUNGFU.AI and Iodine Software continue to work together, identifying additional areas of ML implementation across the organization.‍NLPNLP for Document IntegrityChallengeIodine Software is a software group based in Austin Texas which provides Clinical Document Integrity (CDI) software to hospital systems and clinics across the U.S. They sought to improve their CDI product by using machine learning to extract specific and relevant information from documents and build a competitive moat by leveraging their troves of valuable un-tapped data.SolutionWorking in tandem with Iodine’s existing ML team, KUNGFU.AI leveraged massively pre-trained state of the art natural language models to automatically categorize medical documentation into insurance coding categories. The performance of this model rivals human SME capability.OutcomeWith the improvements made to Iodine’s product, hospitals and clinics across the U.S. are able to recoup millions in unbilled revenue and reduce human tedium. KUNGFU.AI and Iodine Software continue to work together, identifying additional areas of ML implementation across the organization.‍NLP","metadata":{"source":"https://www.kungfu.ai/case-study/nlp-for-document-integrity","title":"NLP for Document IntegrityNLP for Document Integrity","contentLength":295}},{"pageContent":"Data ExtractionChallengeA large brick and mortar retail chain came to us seeking help with optimizing and monetizing their data capture from photos of customer receiptsSolutionKUNGFU built a hybrid model, leveraging client’s existing cloud APIs, a custom YOLOv3 boundingbox detection algorithm, and a Generative Adversarial Network (GAN) model to enhance and extract appropriate textual data from receipts.OutcomeWe were able to meet requirements for latency of <2 seconds and achieve an average F1 Score of 0.88 for detected fields.‍Computer VisionGANData ExtractionChallengeA large brick and mortar retail chain came to us seeking help with optimizing and monetizing their data capture from photos of customer receiptsSolutionKUNGFU built a hybrid model, leveraging client’s existing cloud APIs, a custom YOLOv3 boundingbox detection algorithm, and a Generative Adversarial Network (GAN) model to enhance and extract appropriate textual data from receipts.OutcomeWe were able to meet requirements for latency of <2 seconds and achieve an average F1 Score of 0.88 for detected fields.‍Computer VisionGAN","metadata":{"source":"https://www.kungfu.ai/case-study/data-extraction","title":"Data ExtractionData Extraction","contentLength":163}},{"pageContent":"Pipeline PredictionChallengeKeller Williams needed a more accurate model to predict the likelihood that listings in various pipeline stages will eventually close. Solution We built a data aggregation pipeline that brings in different sources of data into a cohesive view of metadata and time series events for sales pipelines. We developed three types of models, one tree based model, and two types neural network models (one being embeddings + multilayer perceptron, and the other being embeddings + LSTM).OutcomeModel baseline was 15% more accurate than the existing statistical approaches. ‍Gradient Boosted TreesHybrid Recommendation SystemsPipeline PredictionChallengeKeller Williams needed a more accurate model to predict the likelihood that listings in various pipeline stages will eventually close. Solution We built a data aggregation pipeline that brings in different sources of data into a cohesive view of metadata and time series events for sales pipelines. We developed three types of models, one tree based model, and two types neural network models (one being embeddings + multilayer perceptron, and the other being embeddings + LSTM).OutcomeModel baseline was 15% more accurate than the existing statistical approaches. ‍Gradient Boosted TreesHybrid Recommendation Systems","metadata":{"source":"https://www.kungfu.ai/case-study/pipeline-prediction","title":"Pipeline PredictionPipeline Prediction","contentLength":181}},{"pageContent":"Auto Valuation ModelChallengeKeller Williams wanted to strategically pivot into iBuying where they use predictive models to buy and sell real estate online. SolutionKUNGFU.AI developed a proprietary XGBoost, Tree-based ML model that can predict home values accounting for thousands of structured and unstructured features. We established a human-in the loop training systems where brokers can give feedback and train the models.OutcomeSolution helped Keller Williams generate a new revenue stream which is currently being piloted in three markets. ‍Gradient Boosted TreesAuto Valuation ModelChallengeKeller Williams wanted to strategically pivot into iBuying where they use predictive models to buy and sell real estate online. SolutionKUNGFU.AI developed a proprietary XGBoost, Tree-based ML model that can predict home values accounting for thousands of structured and unstructured features. We established a human-in the loop training systems where brokers can give feedback and train the models.OutcomeSolution helped Keller Williams generate a new revenue stream which is currently being piloted in three markets. ‍Gradient Boosted Trees","metadata":{"source":"https://www.kungfu.ai/case-study/auto-valuation-model","title":"Auto Valuation ModelAuto Valuation Model","contentLength":165}},{"pageContent":"Donor MatchingCHALLENGEBone marrow transplant recipients receiving donations from relatives, commonly the only viable donor pool, were rejecting transplants and sometimes dying from poor HLA fit.SOLUTIONBuilt machine learning-based system to efficiently and accurately identify best donor match from thousands of online DNA profiles for biotech company that develops high speed DNA sequencers and software.OUTCOMEDramatically improved transplant success by reducing transplant rejection.‍Machine LearningDonor MatchingCHALLENGEBone marrow transplant recipients receiving donations from relatives, commonly the only viable donor pool, were rejecting transplants and sometimes dying from poor HLA fit.SOLUTIONBuilt machine learning-based system to efficiently and accurately identify best donor match from thousands of online DNA profiles for biotech company that develops high speed DNA sequencers and software.OUTCOMEDramatically improved transplant success by reducing transplant rejection.‍Machine Learning","metadata":{"source":"https://www.kungfu.ai/case-study/donor-matching","title":"Donor MatchingDonor Matching","contentLength":129}},{"pageContent":"Collectibles CompanyCHALLENGEA billion-dollar collectibles company seeks to augment their triage process of identifying rare coins. The objective was to shift time team spends inspecting low value coins to high value coins, speeding up the process and increasing revenue by expanding the markets they can address.SOLUTIONWe trained a machine vision algorithm (CNN) on a subset of 500,000 images of rare coins. We built a prototype application where users upload images of rare coins for identification. OUTCOMEIn two weeks of development, our machine vision application could identify a subset of rare coins with over 90% accuracy with a roadmap to higher accuracy and multiple business use cases for deployment.Computer VisionCollectibles CompanyCHALLENGEA billion-dollar collectibles company seeks to augment their triage process of identifying rare coins. The objective was to shift time team spends inspecting low value coins to high value coins, speeding up the process and increasing revenue by expanding the markets they can address.SOLUTIONWe trained a machine vision algorithm (CNN) on a subset of 500,000 images of rare coins. We built a prototype application where users upload images of rare coins for identification. OUTCOMEIn two weeks of development, our machine vision application could identify a subset of rare coins with over 90% accuracy with a roadmap to higher accuracy and multiple business use cases for deployment.Computer Vision","metadata":{"source":"https://www.kungfu.ai/case-study/collectibles-company","title":"Collectibles CompanyCollectibles Company","contentLength":223}},{"pageContent":"Augmented Ecommerce Sell ThroughCHALLENGE‍Ecommerce company needed to increase product sell-through in online store.‍SOLUTION‍Developed machine learning real-time dynamic algorithm using random forest technique based on customer profile and history to predict most impactful product placement adjacent to primary product being searched.‍OUTCOME‍Improved merchandising and increased sell through rates.‍Random Forest TechniqueAugmented Ecommerce Sell ThroughCHALLENGE‍Ecommerce company needed to increase product sell-through in online store.‍SOLUTION‍Developed machine learning real-time dynamic algorithm using random forest technique based on customer profile and history to predict most impactful product placement adjacent to primary product being searched.‍OUTCOME‍Improved merchandising and increased sell through rates.‍Random Forest Technique","metadata":{"source":"https://www.kungfu.ai/case-study/augmented-ecommerce-sell-through","title":"Augmented Ecommerce Sell ThroughAugmented Ecommerce Sell Through","contentLength":111}}]